Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00-S1/atdf/PIC32CK2051SG00100S1.atdf
        <register name="FILTERCFG" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Filter Configuraiton">
          <bitfield name="Threshold" caption="Filter Threshold" mask="0x7"/>
          <bitfield name="Period" caption="Filter Period" mask="0x1F00"/>
          <bitfield name="ProtectionKey" caption="Filter Protection Key" mask="0xFFFF0000"/>
        </register>
        <register name="SOFTTAMP" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="Soft Tamper">
          <bitfield name="TamperActive" caption="Tamper Active" mask="0x1"/>
          <bitfield name="TamperID" caption="Tamper ID" mask="0x1F00"/>
          <bitfield name="ProtectionKey" caption="Protection Key" mask="0xFFFF0000"/>
        </register>
        <register name="RAWSTAT" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="Raw Status">
        </register>
        <register name="STAT" offset="0x20" rw="RW" size="4" initval="0x00000001" caption="Status">
        </register>
        <register name="TIMESTAMP" offset="0x24" rw="R" size="4" initval="0x00000000" caption="Time Stamp">
        </register>
        <register name="FILTERCNT" offset="0x28" rw="R" size="4" initval="0x00000000" caption="Filter Count">
        </register>
        <register name="SOFTINFO" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="Soft Information">
        </register>
        <register name="HOSTIRQ" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="Host Interrupt">
        </register>
        <register name="SOFTRESET" offset="0x34" rw="R" size="4" atomic-op="set:SOFTRESET" initval="0x00000000" caption="Soft Reset">
        </register>
      </register-group>
      <value-group name="LEVELA__LEVEL0">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELA__LEVEL1">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELA__LEVEL2">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELA__LEVEL3">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELA__LEVEL4">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELA__LEVEL5">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELA__LEVEL6">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELA__LEVEL7">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELB__LEVEL8">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELB__LEVEL9">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELB__LEVEL10">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELB__LEVEL11">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
