Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00-S1/atdf/PIC32CK2051SG00100S1.atdf
      <value-group name="LEVELD__LEVEL28">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELD__LEVEL29">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELD__LEVEL30">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELD__LEVEL31">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
    </module>
    <module name="TIMERS" version="1.0.0" caption="Timer Module">
      <register-group name="TIMERS" caption="Timer Module">
        <register name="RST" offset="0x0" rw="RW" size="4" caption="Reset">
        </register>
        <register name="STOP" offset="0x4" rw="RW" size="4" caption="Stop">
        </register>
        <register name="INTEN" offset="0x8" rw="RW" size="4" caption="Interrupt Enable">
        </register>
        <register name="INTDIS" offset="0xC" rw="RW" size="4" caption="Interrupt Disable">
        </register>
        <register name="STAT" offset="0x10" rw="RW" size="4" caption="Status">
        </register>
        <register name="CNT0" offset="0x18" rw="RW" size="4" caption="Counter 0">
        </register>
        <register name="MATCH0" offset="0x1C" rw="RW" size="4" caption="Match 0">
        </register>
        <register name="CNT1" offset="0x20" rw="RW" size="4" caption="Counter 1">
        </register>
        <register name="MATCH1" offset="0x24" rw="RW" size="4" caption="Match 1">
        </register>
      </register-group>
    </module>
    <module name="WDT" version="1.0.0" caption="Watchdog Timer Module">
      <register-group name="WDT" caption="Watchdog Timer Module">
        <register name="WDCOUNT" offset="0x0" rw="R" size="4" caption="Count">
        </register>
        <register name="WDRELOAD" offset="0x4" rw="RW" size="4" caption="Reload">
        </register>
        <register name="WDKICK" offset="0x8" rw="W" size="4" caption="Kick">
        </register>
        <register name="WDCONTROL" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Control">
          <bitfield name="WDRSTEN" caption="WDRSTEN" mask="0x1"/>
        </register>
        <register name="WDSTATUS" offset="0x10" rw="R" size="4" caption="Status">
        </register>
        <register name="WDSTOP" offset="0x14" rw="W" size="4" caption="Stop">
        </register>
      </register-group>
    </module>
  </modules>
  <pinouts>
  </pinouts>
</avr-tools-device-file>
